#!/usr/bin/env php
<?php

/*
|--------------------------------------------------------------------------
| 加载composer
|--------------------------------------------------------------------------
| 加载composer autoload文件
|
*/
require __DIR__ . '/../vendor/autoload.php';


/*
|--------------------------------------------------------------------------
| 初始化Gaia
|--------------------------------------------------------------------------
| 这里初始化Gaia
|
*/
\gaia\App::init('gateway');



/*
|--------------------------------------------------------------------------
| Plugins插件支持
|--------------------------------------------------------------------------
| 注册Plugins插件
|
*/
\support\Plugin::register();



/*
|--------------------------------------------------------------------------
| 运行程序
|--------------------------------------------------------------------------
| 运行程序，执行queue进程，如需同时运行更多进程，可以在数组内添加
|
*/
\gaia\Gaia::instance()->runProcess([
    'register' => \support\gateway\process\Register::class,
    'business' => \support\gateway\process\Business::class,
    'gateway' => \support\gateway\process\Gateway::class
]);
