<?php

/*
|--------------------------------------------------------------------------
| gateway进程配置文件
|--------------------------------------------------------------------------
| 定义gateway进程配置信息
|
*/

return [
    // 本机ip，分布式部署时使用内网ip
    'lanIp'             => '127.0.0.1',
    //内部通讯起始端口，假如$gateway->count = 4，起始端口为4000, 则一般会使用4000 4001 4002 4003 4个端口作为内部通讯端口，注意：起始端口不要重复
    'startPort'         => 2500,
    // 心跳间隔
    'pingInterval'      => 58,
    // 心跳数据
    'pingData'          => '',
    // 多少心跳间隔时间内客户端未报通信则断开连接（pingInterval * pingNotLimit = 时间间隔）
    'pingNotLimit'      => 0,
    // Register进程服务注册地址
    'registerAddress'   => '127.0.0.1:1236',
    // 链接协议地址
    'address'           => 'websocket://0.0.0.0:8623',
    // 传输协议，一般不需要改动，如需使用ssl，则修改为ssl
    'transport'         => 'tcp',
];
